# Installing Required Libraries

In [1]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\user007\appdata\local\programs\python\python310\lib\site-packages (1.0.2)

In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\user007\appdata\local\programs\python\python310\lib\site-packages (1.5.0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user007\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2022.4)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\user007\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.21.0 in c:\users\user007\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.23.3)
Requirement already satisfied: six>=1.5 in c:\users\user007\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

### Importing Required Libraries

In [3]:
import pymysql
import pandas as pd

### Creating Sql Connection by providing required host,user,password and database name

In [4]:
db=pymysql.connect(host="localhost",user="root",
                  password="xxxxxx")

### Creating a cursor object using the cursor() method

In [5]:
cursor=db.cursor()

### Deleting Database if exists

In [6]:
cursor.execute("DROP DATABASE IF EXISTS TEST1")

1

### Creating Database

In [7]:
sql ='''CREATE DATABASE TEST1'''

In [8]:
cursor.execute(sql)

1

### Deleting Table if exists

In [9]:
cursor.execute("DROP TABLE IF EXISTS TEST1.EMPLOYEE")

0

### Creating Table

In [10]:
sql1 ='''CREATE TABLE TEST1.EMPLOYEE(
   FIRST_NAME CHAR(20) NOT NULL,
   LAST_NAME CHAR(20),
   AGE INT,
   SEX CHAR(1),
   INCOME FLOAT
)'''

In [11]:
cursor.execute(sql1)

0

### Pushing Data to table from csv file

In [12]:
data=pd.read_csv('employee.csv')

In [13]:
data

  FIRST_NAME LAST_NAME  AGE SEX  INCOME
0      Nasir   Hussain   26   M      10
1      Suhel   Hussain   24   M       5
2      Irfan      Khan   28   M      15
3       Rida   Fathima   22   F       3

In [14]:
for row in data.itertuples():
    cursor.execute('''
                INSERT INTO test1.employee (FIRST_NAME, LAST_NAME, AGE, SEX, INCOME)
                VALUES (%s,%s,%s,%s,%s)
                ''',
                (row.FIRST_NAME, 
                row.LAST_NAME,
                row.AGE,
                row.SEX,
                row.INCOME
                ))

In [15]:
db.commit()

In [16]:
sql2='''SELECT * FROM test1.employee'''

In [17]:
cursor.execute(sql2)

4

### Converting the data to dataframe

In [18]:
df=pd.DataFrame(cursor.fetchall())

### Getting columns to the dataframe

In [19]:
col=[]
for i in cursor.description:
    col.append(i[0])

In [20]:
df.columns=col

### Closing database connection

In [21]:
db.close()

### Result

In [22]:
df

  FIRST_NAME LAST_NAME  AGE SEX  INCOME
0      Nasir   Hussain   26   M    10.0
1      Suhel   Hussain   24   M     5.0
2      Irfan      Khan   28   M    15.0
3       Rida   Fathima   22   F     3.0